#### StoneBumpType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "StoneBump" from the "Stone" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum StoneBumpType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StoneBumpType ``` |

| Visual C++ |
| --- |
| ``` public enum class StoneBumpType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Polishedgranite |  |
| Stonewall |  |
| Glossymarble |  |
| Custom |  |

# See Also

Autodesk.Revit.DB.Visual Namespace